src/Catalogs/Команды/Команды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Команды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Доставка</name>
      <description>Доставка</description>
    </items>
    <items>
      <name>Доставка2</name>
      <description>Доставка2</description>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
    </items>
  </predefined>
  <attributes>
    <name>Удалить_Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/РуководителиКоманд/РуководителиКоманд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РуководителиКоманд</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Команды/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
	Поля.Добавить("Ссылка");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РуководителиКомандСрезПоследних.Руководитель.Наименование КАК РуководительНаименование
		|ИЗ
		|	РегистрСведений.РуководителиКоманд.СрезПоследних КАК РуководителиКомандСрезПоследних
		|ГДЕ
		|	РуководителиКомандСрезПоследних.Команда = &Команда";
	Запрос.УстановитьПараметр("Команда", Данные.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	РуководительКоманды = "";
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		РуководительКоманды = Выборка.РуководительНаименование;
	КонецЕсли;
	Представление = СтрШаблон("%1 (%2)", Данные.Наименование, РуководительКоманды);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
